// ==================== Вывод текста в окно браузера ====================

/* document.writeln("<p>Текст<br> выведен <b>в оено браузера</b></p>"); // - Текст выведен в оено браузера
document.writeln("<p><img src='1.jpg' alt=''>Текст</p>"); // - простой метод */

// ==================== Циклы ====================
// - виды циклов:
// - do...while - цикл с пост условием
/* do{
    тело цикла(действие)
}while(условие) */
// - Итерация - это один шаг цикла

/* let i = 0; // i = 0 переменный счетчик
do{
    document.writeln("Это номер:" + i + "<br>");
    i++; // i + 1 и так покругу
}while(i < 5); // i < 5 */

// - квадрат числа
/* let i = 1; 
do{
    document.writeln("Квадрат " + ++i + " равен " + i ** 2 + "<br>");
    // i++; 
}while(i <= 7);  */

/* let i = 0;
do{
    document.writeln("Это номер:" + i + "<br>");
    i = i +5;
}while(i <= 25); */

/* let i = 10;
do{
    document.writeln("Это номер:" + i + "<br>");
    i--;
}while(i > 0); */

// - Вывод только четных чисел
/* let i = 1;
do{
    if(i % 2 == 0){
    document.writeln(` i = ${i}<br>`);
    }
    i++;
}while(i <= 20); */

/* let i = 2;
do{
    document.writeln(` i = ${i}<br>`);
    i = i + 2;
}while(i <= 20); */
// или
/* let i = 2;
do{
    document.writeln(` i = ${i}<br>`);
    i += 2;
}while(i <= 20); */

// написать программу которая находит сумму всех чисел в диапазоне указанном пользователем
// введите начало диапазона
// введите конец диапазона
// сумма целых нечетных чисел

/* let a = +prompt("Введите начало диапазона:");
let b = +prompt("Введите конец диапазона:");

let sum = 0;

do {
    if (a % 2) sum += a; // где i % 2 для нечётных = 1, для чётных = 0
    i++;
} while (a <= b);
document.writeln(`Сумма: ${sum}`); */

/* let n = +prompt("Введите начало диапазона:", 1);
let m = +prompt("Введите конец диапазона:", 5);
let i = n; // 1
let sum = 0;
do { // 3 % 2 => 1
    if (i % 2 != 0) { // i % 2 != 0  // i % 2 == 1
        document.writeln(i + "<br>"); // 1 3 5
        sum = sum + i;
    }
    i++;
} while (i <= m);
document.writeln("Сумма целых нечетныхчисел: " + sum + "<br>"); */

// ========== Переменные ==========
/* let a = 5; // - глобальная переменная

if(a>0 && a<10){
    let b = 6; // - локальная переменная
    document.writeln(a);
}
document.writeln(b); // так нельзя */

/* let a = 5; // - глобальная переменная

if(a>0 && a<10){
    let a = 6; // - локальная переменная
    document.writeln(a); // локальная зона видимости
}
document.writeln(a); // глобальная зона видимости */

// ========== Цикл с пред условием ==========
// цикл while
/* while(условие){
    тело цикла(действие);
} */



/* // сравнение циклов с пред и пост условием
let i = 0;
while (i < 5) {
    document.writeln("Это номер: " + i + "<br>");
    i++;
};

document.writeln("<br><br>");

let j = 0;
do {
    document.writeln("Это номер: " + j + "<br>");
    j++;
} while (j < 5); */


// - вывести ряд звездочек
/* let count = prompt("Укажите колличество звездочек");
let i= 0;
while(i < count){
    document.writeln("*");
    i++;
} */

/* let i = 1;
while (i <= 30){
    if (i % 3 !== 0) {
        document.writeln("Число: " + i + "<br>");
    } else{
        document.writeln("прочие числа: " + i + "<br>");
    }
    i++;
} */
//----------------------------------------------------------------------

// ========== Задача ==========  
// - написать программу вычисляющаая произведение чисел в звдвнном диапазоне наприме 5 и 10 результат = 5*6*7*8*9*10=

/* let start = +prompt("Введите начало диапазона:");
let end = +prompt("Введите конец диапазона:");
let res = 1;
while(start <= end){
    //document.writeln(i + "<br>");
    res *= start;
    start++;
} document.writeln(res + "<br>"); */
//----------------------------------------------------------------------

/* let n

do{
n = prompt("Введите целое число:");
document.writeln(n + "<br>");
}while(n !=0) */

// ============================ Занятие 28.02.2026 ============================

