"use strict";
// ========== Задача ==========
// Введите количество копеек от 1 до 99 с учетом склонения падежа копеек

let a = +prompt("Введите количество копеек от 1 до 99: ");
let b = a % 10;

if (a >= 1 && a <= 99) {

    if (a >= 11 && a <= 14) {
        alert(a + " копеек");
    } else {
        if (b == 1) {
            alert(a + " копейка");
        } else if (b >= 2 && b <= 4) {
            alert(a + " копейки");
        } else {
            alert(a + " копеек");
        }
    }
} else {
    alert("Значение не определено");
}
document.writeln(a +"<br>"+ b);

console.log(a + " " + b);


